app/controllers/sessions_controller.rb

  def create
    # create a new session
    # first get the user
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abcde@gmail.com"], ["LIMIT", 1]]