app/controllers/static_pages_controller.rb

SELECT "users".* FROM "users"
---
  def club
    @users = User.all