app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "abcde@gmail.com"], ["first_name", "pepito"], ["last_name", "banana"], ["password_digest", "$2a$10$f9y81FUO0SkcIBGUf7MaXuMjTJDZkxiHmK4z703Z/a4J7P00xvIGC"]]
---
  def create
    @user = User.new(user_params)
    if @user.save